{
  "backend/main.mo": "Main Motoko actor defining the backend canister with types and CRUD logic for services, blog posts, inquiries (including seedNumber), and user profiles, with authorization and blob storage mixins.",
  "backend/migration.mo": "Migration module that upgrades stored inquiry records from OldInquiry (without seedNumber) to NewInquiry (with optional seedNumber defaulting to null) during canister upgrades.",
  "feature_evidence.json": "Feature evidence report linking two implemented features—adding a Seed Number input to BookingForm.tsx and displaying it in InquiriesTab.tsx—to their respective test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Auto-generated JSON document providing one-sentence summaries of every frontend source file, describing their roles and notable recent changes.",
  "frontend/index.css": "Root CSS file that imports Tailwind directives and defines CSS custom property tokens for light and dark themes covering colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'TriOracle by Astroplam' with SEO meta description and mounting the React root div.",
  "frontend/src/App.tsx": "Root React component that composes the full page layout (Header, Hero, Courses, SpecialUniqueServiceSection, Services, Blog, ComparisonTable, Footer) and conditionally renders AdminDashboard or ProfileSetupModal.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component that checks authentication and admin privileges before rendering a tabbed interface with InquiriesTab and BlogManagementTab.",
  "frontend/src/components/BlogManagementTab.tsx": "Admin tab component for managing blog posts, providing a list view with options to create, edit, delete, and toggle publish status of posts using mutation hooks and toast notifications.",
  "frontend/src/components/BlogPostCard.tsx": "Displays a single blog post card with expandable content, author/date metadata, and admin controls for editing, deleting, and toggling publish status.",
  "frontend/src/components/BlogPostEditor.tsx": "Modal dialog form for creating or editing a blog post, with fields for title, author, and content, using create/update mutation hooks.",
  "frontend/src/components/BlogSection.tsx": "Public-facing blog section that fetches and displays all published posts in a grid of BlogPostCards, with admin controls to create or edit posts.",
  "frontend/src/components/BookingForm.tsx": "Multi-field booking/inquiry form supporting different service types (e.g., matchmaking, single question), with person and place-of-birth sub-sections and file upload, submitting via a mutation hook.",
  "frontend/src/components/ComparisonTable.tsx": "Renders a styled comparison table showing how Astrology, Numerology, and Palmistry each address various life aspects, with both desktop table and (implied) mobile card layouts.",
  "frontend/src/components/CoursesSection.tsx": "Renders a collapsible courses section displaying detailed module/topic breakdowns for astrology-related courses (Predictive Nadi Astrology, Advanced Numerology, etc.) with fees, icons, and expandable module lists.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand info, quick navigation links, service pricing list, and contact email, styled with a dark charcoal/gold theme.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with smooth-scroll nav links, Internet Identity login/logout, admin dashboard button, and a responsive mobile menu.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with celestial decorative elements, the TriOracle brand headline, tagline, and call-to-action scroll buttons.",
  "frontend/src/components/InquiriesTab.tsx": "Admin tab that fetches and displays all user inquiries, with inline image preview modals for hand pictures and palm photos, and a service name lookup map.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown to newly authenticated users to collect and save their name and optional email via the backend profile mutation.",
  "frontend/src/components/ServicesSection.tsx": "Renders a grid of astrology/consultation service cards (e.g., Matchmaking, Muhurat, Gemstone) with pricing, icons, and a booking form triggered per service.",
  "frontend/src/components/SpecialServiceBookingForm.tsx": "A dialog form for submitting Video Prediction or Written Prediction inquiries, collecting personal details, palm photos, and questions via the useSubmitInquiry mutation.",
  "frontend/src/components/SpecialUniqueServiceSection.tsx": "Displays a section for two premium services (Video Prediction and Written Prediction) with descriptions and buttons that open the SpecialServiceBookingForm modal.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access with admin token initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data including services, blog posts, and inquiries (with file upload support).",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Cormorant Garamond, Inter), sets up Tailwind base/components/utilities, defines a spiritual light/dark color palette using OKLCH CSS variables, and declares reusable component classes like btn-gold, card-hover, and section-heading.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters from both regular and hash-based routes, persist them to sessionStorage, and clean sensitive parameters from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens (including a spiritual palette of gold, sage, lavender, charcoal), sets custom fonts, border radii, box shadows, and registers the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state document (version 19) describing the TriOracle by Astroplam astrology website's features, architecture, and content including courses, services, special prediction services, admin blog management via Internet Identity, and a comparison table."
}