{
  "kind": "build_request",
  "title": "Add Seed Number field to One Question service booking form",
  "projectName": "TriOracle by Astroplam",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Add a Seed Number numeric input field (valid range: 1–249, inclusive) to the One Question service booking form in BookingForm.tsx. The field must be clearly labelled 'Seed Number', accept only integer values between 1 and 249, and its value must be submitted alongside all other inquiry fields when the form is sent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "add a detail seed number in this part seed number will be 1-249 any of number person filled in seed number box",
          "I'll add a Seed Number field (numeric input, range 1–249) to the One Question service booking form"
        ]
      },
      "acceptanceCriteria": [
        "The One Question service booking form contains a labelled 'Seed Number' field.",
        "The field only accepts integer values between 1 and 249 inclusive (validation prevents submission outside this range).",
        "The seed number value is submitted with the inquiry when the form is submitted.",
        "No other service booking forms are affected by this change."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Update the backend Inquiry data type in backend/main.mo to add an optional seedNumber field (e.g. seedNumber: ?Nat) to the Inquiry record. Update the submitInquiry function to accept and persist this field. Ensure full backward compatibility so that existing inquiries without a seed number are unaffected.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Should this seed number be stored and visible in the Admin Dashboard alongside the other inquiry details for the One Question service?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "The Inquiry data type includes an optional seedNumber field.",
        "The submitInquiry function accepts and stores the seedNumber value when provided.",
        "Existing inquiries that do not include a seed number continue to work without error.",
        "The seedNumber is retrievable via getAllInquiries for admin display."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Update InquiriesTab.tsx in the Admin Dashboard to display the Seed Number field for One Question service inquiries. Show the seed number alongside the other inquiry details (service type, visitor name, DOB, question, etc.) for any inquiry where a seed number was submitted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Should this seed number be stored and visible in the Admin Dashboard alongside the other inquiry details for the One Question service?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard Inquiries tab shows a 'Seed Number' field for One Question inquiries that have one.",
        "The seed number is clearly labelled and displayed alongside existing inquiry fields.",
        "Inquiries from other service types that do not have a seed number are not affected."
      ]
    }
  ],
  "constraints": [
    "Do not modify any file listed under frontend.immutablePaths.",
    "Seed Number field must only appear on the One Question service booking form, not on any other service forms.",
    "Backend changes must be backward compatible — existing inquiry records must not be broken."
  ],
  "nonGoals": [
    "Adding seed number to any service other than One Question.",
    "Changing the visual theme or layout of any other section.",
    "Modifying blog, comparison table, or special unique service features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}